'''
Ключевые моменты:
Базовая архитектура для текущих проектов:
db/ - тут будет файл с подключением к БД
services/ - тут будут лежать файлики для работы с БД, отправки запросов и их обработке
ui/ - тут будут находиться виджеты и окна приложения
app.py | main.py - запускаемый файл

Технологии для работы:
- Обязательно СУБД, в идеале(PostgreSQL, MySQL, SQLite);
- Язык программирования любой, в идеале(Python, C#, Java, Rust);
- GUI, какой удобно(Tkinter, PyQt, WPF, Qt).

Дополнительно:
- Добавить дамп данных в проект, можно в корневую папку;
'''